#Using Pandas#

In [1]:
import pandas as pd

#Load Data
dF = pd.read_csv('titanic/train.csv')

##Quantitative##

In [2]:
dF.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [3]:
type(dF.describe())

pandas.core.frame.DataFrame

In [4]:
dF.describe().ix[['std','min','max'], 'Survived':] #Exclude stats and PassengerId

     Survived    Pclass        Age     SibSp     Parch        Fare
std  0.486592  0.836071  14.526497  1.102743  0.806057   49.693429
min  0.000000  1.000000   0.420000  0.000000  0.000000    0.000000
max  1.000000  3.000000  80.000000  8.000000  6.000000  512.329200

In [5]:
dF.sum().drop(['PassengerId'])

Survived      342.0000
Pclass       2057.0000
Age         21205.1700
SibSp         466.0000
Parch         340.0000
Fare        28693.9493
dtype: float64

In [6]:
dF.Fare.cumsum()

0       7.2500
1      78.5333
2      86.4583
3     139.5583
4     147.6083
5     156.0666
6     207.9291
7     229.0041
8     240.1374
9     270.2082
10    286.9082
11    313.4582
12    321.5082
13    352.7832
14    360.6374
...
876    28399.7119
877    28407.6077
878    28415.5035
879    28498.6618
880    28524.6618
881    28532.5576
882    28543.0743
883    28553.5743
884    28560.6243
885    28589.7493
886    28602.7493
887    28632.7493
888    28656.1993
889    28686.1993
890    28693.9493
Name: Fare, Length: 891, dtype: float64

In [7]:
dF.Fare.mad() #Mean Absolute Deviation

28.163691848778342

##Qualitative##

In [8]:
dF.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [9]:
qualitative = dF.drop('Name', axis=1).ix[:, dF.dtypes == object]
qualitative.head()

      Sex            Ticket Cabin Embarked
0    male         A/5 21171   NaN        S
1  female          PC 17599   C85        C
2  female  STON/O2. 3101282   NaN        S
3  female            113803  C123        S
4    male            373450   NaN        S

In [10]:
qualitative.describe()

         Sex Ticket        Cabin Embarked
count    891    891          204      889
unique     2    681          147        3
top     male   1601  C23 C25 C27        S
freq     577      7            4      644

In [11]:
print (qualitative.Sex.value_counts())
print (qualitative.Embarked.value_counts())

male      577
female    314
dtype: int64
S    644
C    168
Q     77
dtype: int64